
[SparkRifle_Chosen X2WeaponTemplate]
FriendlyName="Blackstone Forged Cannon"
FriendlyNamePlural="Blackstone Forged Cannon"
BriefSummary="This MEC-sized heavy weapon core is the result of processing the Sun of Elder's HomeWorld, which even existed indescribable. With a variety of firing patterns, these weapons can emit deadly anti-entropy entity warheads without a break, or emit ravenous dark energy vines that burn everything in front of them."
TacticalText="The Blackstone Forged Cannon (Aka 'BFC') is an autocannon with the chosen weapon specification.<br/><bullet/> If Enemies that Miss the BFC's fire are immediately engulfed in a massive explosion, Shooting through this weapon will never cause dodge.<br/><bullet/> BFC has a variety of firing modes, either melting anything that goes through blackstone flames, or by charging a Wrath cannon to fire in a straight line."
AbilityDescName="autocannon"


[ArtilleryCannon_Chosen X2WeaponTemplate]
FriendlyName="W-2000 'The Fixer' Heavy Cannon"
FriendlyNamePlural="W-2000 'The Fixer' Heavy Cannon"
BriefSummary="It's clear that this heavy cannon is a huge Dark Lance and a derivative of the 'Chosen's Siege Cannon' which almost destroyed the Avenger over and over again, but no one has chosen to handle such a massive personal weapon. Anyway,'W2000 the Fixer', which seems to materialize the idea of a gun, has a tendency to manipulate all the laws of physics in order to destroy the enemy by accelerating the exotic material accelerating rail and its ego. All attempts to calculate the impulse of the warhead leaving the muzzle have failed."
TacticalText="W-2000'The Fixer' Heavy Cannon (AKA'The Fixer') is a Heavy Cannon with Chosen weapon specifications. <br/><bullet/> Shooting through the The Fixer guarantees a critical hit against enemies with armor or hiding under covers.<br/><bullet/> Anti-entropy projectiles fired by The Fixer penetrate the cover and rip the target with flesh and armor, but the target behind the half and full cover You receive a damage penalty of <Ability:IRI_HEAVY_CANNON_LOW_COVER_DAMAGE_PENALTY/>/<Ability:IRI_HEAVY_CANNON_HIGH_COVER_DAMAGE_PENALTY/> instead of aiming penalty.<br/><bullet/> Heavy Cannon must consume 2 action points after firing. However, The Fixer only consumes 1 action point.<br/><bullet/> Equipping special ammunitionincreases the flexibility of The Fixer's operation.<br/><bullet/> All The Fixer shots get the effect of a special ammunition."
AbilityDescName="HeavyCannon"


[Chosen_KineticStrikeModule X2WeaponTemplate]
FriendlyName="World Breaker Module"
FriendlyNamePlural="World Breaker Module"
BriefSummary="The World Breaker module is a super heavy melee weapon made by applying the'disrupter field coating' technology applied to the assassin's katana.. Whenever it deals physical damage to an enemy, it emits a huge shockwave that shatters the surrounding perception."
TacticalText="World Breaker Module is a Kinetic Strike Module with Chosen weapon specifications.  <br/><bullet/> All Kinetic Strike-based skills through the World Breaker module inflict an AoE attack around the target."
AbilityDescName="Kinetic Strike Module"

[ChosenArtilleryCannon_Passive X2AbilityTemplate]
LocFriendlyName="Reverse-Causal Acceleration"
LocLongDescription="Shooting through the W-2000 Heavy Cannon guarantees a critical hit against enemies with armor or hiding under covers."
LocHelpText="Shooting through the W-2000 Heavy Cannon guarantees a critical hit against enemies with armor or hiding under covers."
LocFlyOverText="Reverse-Causal Acceleration"

[ReverseCausalAcceleration X2AbilityTemplate]
LocFriendlyName="Reverse-Causal Acceleration"
LocLongDescription="Shooting through the W-2000 Heavy Cannon guarantees a critical hit against enemies with armor or hiding under covers."
LocHelpText="Shooting through the W-2000 Heavy Cannon guarantees a critical hit against enemies with armor or hiding under covers."
LocFlyOverText="Reverse-Causal Acceleration"

[ChosenArtilleryCannonReaper X2AbilityTemplate]
LocFriendlyName="Reverse Blast"
LocLongDescription="Any fire that does not use a Special Ammunition destroys all cover terrain around the target—hit or not."
LocHelpText="Any fire that does not use a Special Ammunition destroys all cover terrain around the target—hit or not."
LocFlyOverText="Reverse Blast"

[ChosenSparkRifle_Passive X2AbilityTemplate]
LocFriendlyName="Unavoidable"
LocLongDescription="If the enemy is not hit by the Blackstone Forged Cannon fire,will be immediately engulfed in an even greater catastrophe that is engulfed in Explosions."
LocHelpText="If Enemies that Miss the Blackstone Forged Cannon's fire are immediately engulfed in a massive explosion."
LocFlyOverText="Unavoidable"

[BusterCannon X2AbilityTemplate]
LocFriendlyName="Wrath Cannon mode"
LocLongDescription="After charging all the power and ammo of this weapon, Unleashed a massive attack across multiple enemies and the map. takes 1 turn to prepare."
LocHelpText="Unleashed a massive attack across multiple enemies and the map. takes 1 turn to prepare."
LocFlyOverText="Wrath Cannon mode"

[KSMReaper X2AbilityTemplate]
LocFriendlyName="Disintegration"
LocLongDescription="All Kinetic Strike-based skills through the World Breaker module inflict an AoE attack around the target."
LocHelpText="All Kinetic Strike-based skills through the World Breaker module inflict an AoE attack around the target."
LocFlyOverText="Disintegration"

[KSMBustImmunity X2AbilityTemplate]
LocFriendlyName="Disintegration"
LocLongDescription="All Kinetic Strike-based skills through the World Breaker module inflict an AoE attack around the target."
LocHelpText="All Kinetic Strike-based skills through the World Breaker module inflict an AoE attack around the target."
LocFlyOverText="Disintegration"


[SparkRifle_Chosen X2TechTemplate]
DisplayName="Chosen's Superheavy Weapon Manufacturing: Autocannon"
Summary="Found something interesting about what remained of Warlock's Stronghold. It is the blueprint of a MEC size heavy weapon with the chosen specification and its related modular parts, and it was supposed to be given to a chosen that does not exist. With enough Elerium cores, it looks like our engineers could try to rebuild it.”


[ArtilleryCannon_Chosen X2TechTemplate]
DisplayName="Chosen's Superheavy Weapon Manufacturing: Heavycannon"
Summary="The speculation that the Hunter would personally hunt the Avenger was true. Analysis of the modular parts left behind in the Hunter's stronghold reveals that when assembled, it creates a very large dark lance that fires a warhead with an acceleration that is physically impossible. Only mechanized units like SPARK can handle the recoil."

[KSM_Chosen X2TechTemplate]
DisplayName="Chosen's Superheavy Weapon Manufacturing: Kinetic Strike Module"
Summary="Although there is no progress on the Extraterrestrial material applied to the assassin's katana blade, the Disruptor Field that isolates that entity blade has the property of disintegrating everything except the katana itself. If this'D-Field Strike Module' project succeeds, have our own chosen weapon-literally'Breakable World'."